mdarob/Autonomous-Car/mongoose_car/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MK82FN256xxx15
package_id: MK82FN256VLL15
mcu_data: ksdk2_0
processor_version: 4.0.1
board: FRDM-K82F
pin_labels:
- {pin_num: '17', pin_signal: USB0_DP, label: 'J11[3]/USB_DP'}
- {pin_num: '18', pin_signal: USB0_DM, label: 'J11[2]/USB_DN'}
- {pin_num: '90', pin_signal: PTC17/LPUART3_TX/FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b/SDRAM_DQM3, label: 'U12[3]', identifier: USB_FLAG}
- {pin_num: '40', pin_signal: TSI0_CH5/PTA4/LLWU_P3/FTM0_CH1/FXIO0_D14/EMVSIM0_VCCEN/NMI_b, label: SW2, identifier: SW2}
- {pin_num: '39', pin_signal: TSI0_CH4/PTA3/LPUART0_RTS_b/FTM0_CH0/FXIO0_D13/EMVSIM0_RST/JTAG_TMS/SWD_DIO, label: 'J19[2]'}
- {pin_num: '33', pin_signal: VBAT, label: VBAT, identifier: VBAT}
- {pin_num: '6', pin_signal: VDDIO_E6, label: VDDIO_E_1V8}
- {pin_num: '15', pin_signal: VDDIO_E17, label: VDDIO_E_1V8}
- {pin_num: '20', pin_signal: VREGIN, label: P5V_K81F}
- {pin_num: '23', pin_signal: VREFH, label: VDD_K81F}
- {pin_num: '22', pin_signal: VDDA, label: VDD_K81F}
- {pin_num: '34', pin_signal: VDD46, label: VDD_K81F}
- {pin_num: '48', pin_signal: VDD70, label: VDD_K81F}
- {pin_num: '61', pin_signal: VDD94, label: VDD_K81F}
- {pin_num: '75', pin_signal: VDD108, label: VDD_K81F}
- {pin_num: '89', pin_signal: VDD122, label: VDD_K81F}
- {pin_num: '99', pin_signal: VDD135, label: VDD_K81F}
- {pin_num: '19', pin_signal: VOUT33, label: C43/VOUT33}
- {pin_num: '31', pin_signal: XTAL32, label: 'Y1[2]/XTAL32_RTC', identifier: XTAL32K}
- {pin_num: '32', pin_signal: EXTAL32, label: 'Y1[1]/EXTAL32_RTC', identifier: EXTAL32K}
- {pin_num: '50', pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0/TPM_CLKIN0, label: 'Y2[3]/EXTAL', identifier: EXTAL0}
- {pin_num: '51', pin_signal: XTAL0/PTA19/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1/LPTMR1_ALT1/TPM_CLKIN1, label: 'Y2[1]/XTAL', identifier: XTAL0}
- {pin_num: '24', pin_signal: VREFL, label: GND}
- {pin_num: '25', pin_signal: VSSA, label: GND}
- {pin_num: '5', pin_signal: VSS5, label: GND}
- {pin_num: '16', pin_signal: VSS23, label: GND}
- {pin_num: '35', pin_signal: VSS47, label: GND}
- {pin_num: '49', pin_signal: VSS71, label: GND}
- {pin_num: '60', pin_signal: VSS93, label: GND}
- {pin_num: '74', pin_signal: VSS107, label: GND}
- {pin_num: '88', pin_signal: VSS121, label: GND}
- {pin_num: '98', pin_signal: VSS134, label: GND}
- {pin_num: '80', pin_signal: CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7/SDRAM_A15/FXIO0_D16, label: 'J1[14]/J12[17]/D6/LEDRGB_RED/Camera Reset', identifier: LED_RED;FLEXIO_RESET}
- {pin_num: '81', pin_signal: CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/SDRAM_A14/FTM2_FLT0/FXIO0_D17, label: 'J1[16]/D7/LEDRGB_GREEN', identifier: LED_GREEN}
- {pin_num: '82', pin_signal: PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5/SDRAM_A13/FXIO0_D18, label: 'J1[12]/D5/LEDRGB_BLUE', identifier: LED_BLUE}
- {pin_num: '36', pin_signal: TSI0_CH1/PTA0/LPUART0_CTS_b/FTM0_CH5/FXIO0_D10/EMVSIM0_CLK/JTAG_TCLK/SWD_CLK, label: 'J19[4]'}
- {pin_num: '38', pin_signal: TSI0_CH3/PTA2/LPUART0_TX/FTM0_CH7/I2C3_SCL/FXIO0_D12/EMVSIM0_PD/JTAG_TDO/TRACE_SWO, label: 'J2[20]J12[3]/J19[6]/U6[4]/I2C_SCL', identifier: I2C_SCL}
- {pin_num: '52', pin_signal: RESET_b, label: 'J3[6]/J19[10]/RESET'}
- {pin_num: '7', pin_signal: PTE4/LLWU_P2/SPI1_SIN/LPUART3_TX/SDHC0_D3/QSPI0A_DATA1, label: 'U11[2]/QSPIA_DATA1', identifier: QSPIA_DATA1}
- {pin_num: '3', pin_signal: PTE2/LLWU_P1/SPI1_SOUT/LPUART1_CTS_b/SDHC0_DCLK/QSPI0A_DATA0/SPI1_SCK, label: 'U11[5]/QSPIA_DATA0', identifier: QSPIA_DATA0}
- {pin_num: '4', pin_signal: PTE3/SPI1_PCS2/LPUART1_RTS_b/SDHC0_CMD/QSPI0A_DATA2/SPI1_SOUT, label: 'U11[3]/QSPIA_DATA2', identifier: QSPIA_DATA2}
- {pin_num: '1', pin_signal: PTE0/SPI1_PCS1/LPUART1_TX/SDHC0_D1/QSPI0A_DATA3/I2C1_SDA/RTC_CLKOUT, label: 'U11[7]/QSPIA_DATA3', identifier: QSPIA_DATA3}
- {pin_num: '8', pin_signal: PTE5/SPI1_PCS0/LPUART3_RX/SDHC0_D2/QSPI0A_SS0_B/FTM3_CH0/USB0_SOF_OUT, label: 'U11[1]/QSPIA_SS', identifier: QSPIA_SS}
- {pin_num: '2', pin_signal: PTE1/LLWU_P0/SPI1_SCK/LPUART1_RX/SDHC0_D0/QSPI0A_SCLK/I2C1_SCL/SPI1_SIN, label: 'U11[6]/QSPIA_SCLK', identifier: QSPIA_SCLK}
- {pin_num: '11', pin_signal: PTE8/I2S0_RXD1/SPI2_SOUT/I2S0_RX_FS/QSPI0B_DATA0/FTM3_CH3/SDHC0_D5, label: 'U13[5]/QSPIB_DATA0', identifier: QSPIB_DATA0}
- {pin_num: '12', pin_signal: PTE9/LLWU_P17/I2S0_TXD1/SPI2_PCS1/I2S0_RX_BCLK/QSPI0B_DATA2/FTM3_CH4/SDHC0_D6, label: 'U13[3]/QSPIB_DATA2', identifier: QSPIB_DATA2}
- {pin_num: '9', pin_signal: PTE6/LLWU_P16/SPI1_PCS3/LPUART3_CTS_b/I2S0_MCLK/QSPI0B_DATA3/FTM3_CH1/SDHC0_D4, label: 'U13[7]/QSPIB_DATA3', identifier: QSPIB_DATA3}
- {pin_num: '13', pin_signal: PTE10/LLWU_P18/I2C3_SDA/SPI2_SIN/I2S0_TXD0/QSPI0B_DATA1/FTM3_CH5/SDHC0_D7, label: 'U13[2]/QSPIB_DATA1', identifier: QSPIB_DATA1}
- {pin_num: '14', pin_signal: PTE11/I2C3_SCL/SPI2_PCS0/I2S0_TX_FS/QSPI0B_SS0_B/FTM3_CH6/QSPI0A_DQS, label: 'U13[1]/QSPIB_SS', identifier: QSPIB_SS0}
- {pin_num: '10', pin_signal: PTE7/SPI2_SCK/LPUART3_RTS_b/I2S0_RXD0/QSPI0B_SCLK/FTM3_CH2/QSPI0A_SS1_B, label: 'U13[6]/QSPIB_SCLK', identifier: QSPIB_SCLK}
- {pin_num: '64', pin_signal: TSI0_CH11/PTB18/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/SDRAM_A23/FTM2_QD_PHA/TPM2_CH0/FXIO0_D6, label: 'J12[14]/E1/TSI_CH11/FXIO_D6', identifier: TSI_ELECTRODE_1}
- {pin_num: '65', pin_signal: TSI0_CH12/PTB19/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB/TPM2_CH1/FXIO0_D7, label: 'J12[13]/E2/TSI_CH12/FXIO_D7', identifier: TSI_ELECTRODE_2}
- {pin_num: '73', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/LPUART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, label: 'J2[2]/J12[8]/J24[3]/D8/BLUETOOTH_UART1_RX/XCLK', identifier: BT_RX;FLEXIO_DATA}
- {pin_num: '76', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/LPUART1_TX/FTM0_CH3/FB_AD11/SDRAM_A19/CMP1_OUT, label: 'J24[4]/BLUETOOTH_UART1_TX', identifier: BT_TX}
- {pin_num: '55', pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/LPUART0_RTS_b/SDRAM_WE/FTM0_FLT3/FXIO0_D2, label: 'J4[12]/J12[5]/A4/I2C0_SCL/FXIO_D2/VSYNC', identifier: FLEXIO_VSYNC}
- {pin_num: '53', pin_signal: ADC0_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/SDRAM_CAS_b/FTM1_QD_PHA/TPM1_CH0/FXIO0_D0, label: 'J4[2]/J12[7]/D0/A0/FXIO_D0/PCLK',
  identifier: FLEXIO_PCLK}
- {pin_num: '69', pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FB_AD28/SDRAM_D28/FXIO0_D11, label: 'J2[7]/J12[9]/J22[8]/FXIO_D11/RF_IRQ', identifier: FLEXIO_DATA}
- {pin_num: '67', pin_signal: PTB21/SPI2_SCK/FB_AD30/SDRAM_D30/CMP1_OUT/FXIO0_D9, label: 'J2[3]/J12[11]/FXIO_D9', identifier: FLEXIO_DATA}
- {pin_num: '59', pin_signal: PTB11/SPI1_SCK/LPUART3_TX/I2C2_SDA/FB_AD18/SDRAM_D18/FTM0_FLT2/FXIO0_D5, label: 'J12[15]/FXIO_D7', identifier: FLEXIO_DATA}
- {pin_num: '37', pin_signal: TSI0_CH2/PTA1/LPUART0_RX/FTM0_CH6/I2C3_SDA/FXIO0_D11/EMVSIM0_IO/JTAG_TDI, label: 'J2[18]/J12[4]/U6[6]/D14/I2C SDA', identifier: I2C_SDA}
- {pin_num: '56', pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/LPUART0_CTS_b/SDRAM_CS0_b/FTM0_FLT0/FXIO0_D3, label: 'J4[10]/J12[6]/A4/I2C0_SDA/FXIO_D3/HREF', identifier: FLEXIO_HREF}
- {pin_num: '68', pin_signal: PTB22/SPI2_SOUT/FB_AD29/SDRAM_D29/FXIO0_D10, label: 'J2[5]/J12[10]/FXIO_D10', identifier: FLEXIO_DATA}
- {pin_num: '66', pin_signal: PTB20/SPI2_PCS0/FB_AD31/SDRAM_D31/CMP0_OUT/FXIO0_D8, label: 'J2[1]/J4[9]/J12[12]/FXIO_D8', identifier: FLEXIO_DATA}
- {pin_num: '58', pin_signal: PTB10/SPI1_PCS0/LPUART3_RX/I2C2_SCL/FB_AD19/SDRAM_D19/FTM0_FLT1/FXIO0_D4, label: 'J12[16]/FXIO_D4', identifier: FLEXIO_DATA}
- {pin_num: '57', pin_signal: PTB9/SPI1_PCS1/LPUART3_CTS_b/FB_AD20/SDRAM_D20, label: 'J12[9]/J22[4]/RF_SPI1_PCS1', identifier: CAM_PDWN}
- {pin_num: '70', pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/PDB0_EXTRG/USB0_SOF_OUT/FB_AD14/SDRAM_A22/I2S0_TXD1/FXIO0_D12, label: 'J2[9]/J22[3]/FXIO_D12/RF_GPIO_CE'}
- {pin_num: '96', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/LPUART0_CTS_b/FTM0_CH5/FB_AD1/SDRAM_A9/EWM_OUT_b/SPI1_SCK, label: 'J22[5]/RF_SPI1_SCK'}
- {pin_num: '100', pin_signal: PTD7/CMT_IRO/LPUART0_TX/FTM0_CH7/SDRAM_CKE/FTM0_FLT1/SPI1_SIN, label: 'J22[7]/RF_SPI1_SIN'}
- {pin_num: '97', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/LPUART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: 'J22[6]/RF_SPI1_SOUT'}
- {pin_num: '85', pin_signal: PTC13/LPUART4_CTS_b/FTM_CLKIN1/FB_AD26/SDRAM_D26/TPM_CLKIN1, label: 'U6[11]', identifier: ACCEL_INT1}
- {pin_num: '62', pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/LPUART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0, label: 'J1[2]/D0_UART0_RX'}
- {pin_num: '63', pin_signal: TSI0_CH10/PTB17/SPI1_SIN/LPUART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1, label: 'J1[4]/D0_UART0_TX'}
- {pin_num: '84', pin_signal: PTC12/LPUART4_RTS_b/FTM_CLKIN0/FB_AD27/SDRAM_D27/FTM3_FLT0/TPM_CLKIN0, label: 'J1[6]/D2'}
- {pin_num: '91', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/LPUART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b/FXIO0_D22, label: 'J1[8]/D3'}
- {pin_num: '83', pin_signal: PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b/FXIO0_D19, label: 'J1[10]/D4'}
- {pin_num: '41', pin_signal: PTA5/USB0_CLKIN/FTM0_CH2/FXIO0_D15/I2S0_TX_BCLK/JTAG_TRST_b, label: 'J1[1]/I2S_TX_BCLK'}
- {pin_num: '43', pin_signal: PTA13/LLWU_P4/FTM1_CH1/TRACE_D3/FXIO0_D19/I2S0_TX_FS/FTM1_QD_PHB/TPM1_CH1, label: 'J1[3]/I2S_TX_FS'}
- {pin_num: '42', pin_signal: PTA12/FTM1_CH0/TRACE_CLKOUT/FXIO0_D18/I2S0_TXD0/FTM1_QD_PHA/TPM1_CH0, label: 'J1[5]/I2S_TXD'}
- {pin_num: '47', pin_signal: PTA17/SPI0_SIN/LPUART0_RTS_b/FXIO0_D23/I2S0_MCLK, label: 'J1[9]/I2S_MCLK'}
- {pin_num: '44', pin_signal: PTA14/SPI0_PCS0/LPUART0_TX/TRACE_D2/FXIO0_D20/I2S0_RX_BCLK/I2S0_TXD1, label: 'J1[9]/I2S_RX_BCLK'}
- {pin_num: '79', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8/SDRAM_A16/FXIO0_D15, label: 'J1[11]/SOF_OUT'}
- {pin_num: '46', pin_signal: PTA16/SPI0_SOUT/LPUART0_CTS_b/TRACE_D0/FXIO0_D22/I2S0_RX_FS/I2S0_RXD1, label: 'J1[13]/I2S_RX_FS'}
- {pin_num: '45', pin_signal: PTA15/SPI0_SCK/LPUART0_RX/TRACE_D1/FXIO0_D21/I2S0_RXD0, label: 'J1[15]/I2S_RXD'}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/LPTMR1_ALT2/I2S0_RXD0/FB_AD10/SDRAM_A18/CMP0_OUT/FTM0_CH2, label: 'J2[4]/D9'}
- {pin_num: '95', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/LPUART0_RTS_b/FTM0_CH4/FB_AD2/SDRAM_A10/EWM_IN/SPI1_PCS0, label: 'J2[6]/D10/SPI0_PCS1'}
- {pin_num: '93', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/LPUART2_RX/FTM3_CH2/FB_AD4/SDRAM_A12/I2C0_SCL, label: 'J2[8]/D11/SPI0_SOUT'}
- {pin_num: '94', pin_signal: PTD3/SPI0_SIN/LPUART2_TX/FTM3_CH3/FB_AD3/SDRAM_A11/I2C0_SDA, label: 'J2[10]/D12/SPI0_IN'}
- {pin_num: '92', pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/LPUART2_CTS_b/FTM3_CH1/FB_CS0_b/FXIO0_D23, label: 'J2[12]/D13/SPI0_SCK'}
- {pin_num: '29', pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: 'J4[11]/DAC0_OUT'}
- {pin_num: '72', pin_signal: ADC0_SE4b/CMP1_IN0/TSI0_CH15/PTC2/SPI0_PCS2/LPUART1_CTS_b/FTM0_CH1/FB_AD12/SDRAM_A20/I2S0_TX_FS, label: 'J4[8]/A3'}
- {pin_num: '71', pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/LPUART1_RTS_b/FTM0_CH0/FB_AD13/SDRAM_A21/I2S0_TXD0/FXIO0_D13, label: 'J4[6]/A2'}
- {pin_num: '54', pin_signal: ADC0_SE9/TSI0_CH6/PTB1/I2C0_SDA/FTM1_CH1/SDRAM_RAS_b/FTM1_QD_PHB/TPM1_CH1/FXIO0_D1, label: 'J4[4]/D1/A1'}
- {pin_num: '30', pin_signal: RTC_WAKEUP_B, label: 'J3[7]'}
- {pin_num: '26', pin_signal: ADC0_DP1, label: 'J3[5]'}
- {pin_num: '27', pin_signal: ADC0_DM1, label: 'J3[1]'}
- {pin_num: '87', pin_signal: PTC15/LPUART4_TX/FB_AD24/SDRAM_D24/FXIO0_D21, label: OpenSDA_UART, identifier: DEBUG_UART_TX}
- {pin_num: '86', pin_signal: PTC14/LPUART4_RX/FB_AD25/SDRAM_D25/FXIO0_D20, label: OpenSDA_UART, identifier: DEBUG_UART_RX}
- {pin_num: '78', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/SDRAM_A17/I2S0_MCLK/FXIO0_D14, label: SW3, identifier: SW3}
- {pin_num: '28', pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC0_SE22, label: 'J3[3]/VREF_OUT'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

